<template>
  <van-row>
    <van-row class="top_nav_bar nav_bgm">
      <van-nav-bar title="注册协议" left-arrow @click-left="onBack()" />
    </van-row>
    <van-row class="main_body">
      <van-row class="loginprotocol">
        <van-row class="top_content">
          亲爱的用户，感谢您选用朱鹊医访的各项服务！注册前请阅读本协议，审阅并接受或不接受本协议（未成年人应在法定监护人陪同下审阅）。已经注册为本网站用户即表示您已充分阅读、理解并同意自己与本网站订立本协议，且您自愿受本协议的条款约束。如您通过本站或其他朱鹊医访允许的方式实际使用朱鹊医访服务时，即表示您已充分阅读、理解并接受本协议的全部内容，并与朱鹊医访达成协议。若您不同意本协议，您应立即停止注册或停止使用朱鹊医访服务。
        </van-row>
        <van-row class="loginprotocol_title">一、协议服务范围</van-row>
        <van-row class="loginprotocol_content">
          1、本协议由您和上海异明企业管理咨询有限公司（以下简称为“异明公司”）订立，本协议具有合同效力。
          <br />
          2、除另行明确声明外，朱鹊医访服务包含任何朱鹊医访及其关联公司、第三方服务商提供的基于互联网以及移动互联网的相关服务，且均受本协议约束。服务的具体内容由异名公司根据实际情况提供，例如小鱼儿（www.xiaoyuer.com）等。
          <br />
          3、本协议内容包括协议正文、法律声明、《朱鹊医访服务规则》及所有朱鹊医访已经发布或将来可能发布的各类规则、公告或通知（以下合称“朱鹊医访规则”或“规则”）。所有规则为本协议不可分割的组成部分，与协议正文具有同等法律效力。
          <br />
          4、朱鹊医访有权依据国家法律法规调整的要求和公平交易的商业原则及时地制订、修改本协议及各类规则，并以网站公示的方式进行变更公告，无需另行单独通知您。变更后的协议和规则一经在网站/移动互联网公布后，立即或在公告明确的特定时间自动生效。若您在前述变更公告后继续使用朱鹊医访服务的，即表示您已经阅读、理解并接受经修订的协议和规则。若您不同意相关变更，应当立即停止使用朱鹊医访服务。
        </van-row>
        <van-row class="loginprotocol_title">二、用户资格</van-row>
        <van-row class="loginprotocol_content">
          1、只有符合下列条件之一的自然人或法人才能申请成为本网站用户，可以使用本软件的服务：
          <br />
          a）年满十八岁，并具有民事权利能力和民事行为能力的自然人；
          <br />
          b）无民事行为能力人或限制民事行为能力人应在其监护人的监护下使用朱鹊医访服务；
          <br />
          2、根据中国法律、法规、行政规章成立并合法存在的机关、企事业单位、社团组织和其他组织。无合法资格的单位或组织不当注册为本网站用户的，其与本网站之间的协议自始无效，本网站一经发现，有权立即终止对该用户的服务，并追究其使用本网站服务造成各方损害的一切法律责任。
          <br />
          3、用户在参与签约，费用提取时需要提供明确的联系电话，并完成实名认证。
          <br />
          4、用户须承诺遵守法律法规、社会主义制度、国家利益、公民合法权益、公共秩序、社会道德风尚和信息真实性。
        </van-row>
        <van-row class="loginprotocol_title">三、用户的权利和义务</van-row>
        <van-row class="loginprotocol_content">
          1、用户有权根据本协议及本网站发布的相关规则，利用本网站发布信息、查询用户信息、参与签约，在本网站论坛及相关产品发布信息，参加本网站的有关活动及有权享受本网站提供的其他有关资讯及信息服务。
          <br />
          2、用户应当向本网站提供真实准确的注册信息，包括但不限于真实姓名、身份证号、联系电话、邮箱、地址、邮政编码、职业技能等。同时，用户也应当在相关资料实际变更时及时更新有关注册资料。如发现您提供的资料错误、不实、过时或不完整的，朱鹊医访有权向您发出询问及/或要求改正的通知，并有权直接做出删除相应资料的处理，直至中止、终止对您提供部分或全部朱鹊医访服务。朱鹊医访对此不承担任何责任，您将承担因此产生的任何直接或间接损失及不利后果。
          <br />
          3、用户应当确保提供的电子邮件地址、联系电话等联系方式正确无误，可以让朱鹊医访后台运营或销售经理与您进行有效联系，如通过这些联系方式无法与您取得联系，导致您在使用朱鹊医访过程中产生任何损失或增加费用的，应由您完全独自承担。
          <br />
          4、用户的帐号不得以任何方式买卖、转让、赠与或继承，除非有法律明确规定或司法裁定，并经朱鹊医访同意，且需提供朱鹊医访要求的合格的文件材料并根据操作流程办理。
          <br />
          5、用户有义务确保在本网站上信息真实、准确，无误导性。不得违反国家法律、法规、行政规章的规定，不得侵犯他人知识产权或其他合法权益的信息，不得违背社会公共利益或公共道德，不得违反朱鹊医访的相关规定。
          <br />
          6、用户在本网站使用中应当遵守诚实信用原则，不得以干预或操纵发布需求等不正当竞争方式扰乱网上交易秩序，不得从事与网上交易无关的不当行为。
          <br />
          7、用户不应采取不正当手段（包括但不限于虚假需求、互换好评等方式）提高自身或他人信用度，或采用不正当手段恶意评价其他用户，降低其他用户信用度。
          <br />
          8、用户不得违反《银行卡业务管理办法》使用银行卡，或利用信用卡套取现金（以下简称套现）；用户不得盗刷他人银行卡；用户不得明知或应知他人可能盗刷银行卡而与对方进行交易。
          <br />
          9、用户承诺自己在使用本网站实施的所有行为遵守法律、法规、行政规章和本网站的相关规定以及各种社会公共利益或公共道德。如有违反导致任何法律后果的发生，用户将以自己的名义独立承担相应的法律责任。
          <br />
          10、用户在本网站网上交易过程中如与后台交易产生纠纷，可以请求本网站从中予以协调处理。用户如发现其他用户有违法或违反本协议的行为，可以向本网站举报。
          <br />
          11、除朱鹊医访另有规定外，用户应当自行承担因交易产生的相关费用，并依法纳税（朱鹊医访将委托小鱼儿网将依法为个体服务商完成纳税工作）。
          <br />
          12、未经本网站书面允许，用户不得将本网站的任何资料以及在交易平台上所展示的任何信息作商业性利用（包括但不限于以复制、修改、翻译等形式制作衍生作品、分发或公开展示）。朱鹊医访若因用户的不正当行为产生的所有损失，此用户将给予全额赔偿。
          <br />
          13、用户不得使用以下方式登录网站或破坏网站所提供的服务：
          <br />
          a）以任何机器人软件、蜘蛛软件、爬虫软件、刷屏软件或其它自动方式访问或登录本网站；
          <br />
          b）通过任何方式对本公司内部结构造成或可能造成不合理或不合比例的重大负荷的行为；
          <br />
          c）通过任何方式干扰或试图干扰网站的正常工作或网站上进行的任何活动。
          <br />
          朱鹊医访若因用户的不正当行为产生的所有损失，此用户将给予全额赔偿。
          <br />
          14、用户同意接收来自本网站的信息，包括但不限于活动信息、交易信息、促销信息等。
        </van-row>
        <van-row class="loginprotocol_title">四、朱鹊医访的权利和义务</van-row>
        <van-row class="loginprotocol_content">
          1、朱鹊医访对朱鹊医访服务不作任何明示或暗示的保证，包括但不限于朱鹊医访服务的适用性、没有错误或疏漏、持续性、准确性、可靠性、适用于某一特定用途。同时，朱鹊医访也不对朱鹊医访服务所涉及的技术及信息的有效性、准确性、正确性、可靠性、质量、稳定、完整和及时性做出任何承诺和保证。
          <br />
          2、本网站仅作为您获取需求和产品服务信息、创建推广服务活动、就服务进行协商及开展交易的场所，平台上的服务和需求信息系由用户自行发布，且可能存在风险和瑕疵，朱鹊医访无法完全控制交易所涉及的服务的质量、安全或合法性，信息的真实性或准确性，以及交易各方履行其在贸易协议中各项义务的能力。您应自行谨慎判断确定相关信息的真实性、合法性和有效性，并自行承担因此产生的责任与损失。
          <br />
          3、本网站有义务在现有技术水平的基础上努力确保整个网上交流平台的正常运行，尽力避免服务中断或将中断时间限制在最短时间内，保证用户网上交流活动的顺利进行。
          <br />
          4、本网站有义务对用户在注册使用本网站信息平台中所遇到的与交易或注册有关的问题及反映的情况及时作出回复。
        </van-row>
      </van-row>
    </van-row>
  </van-row>
</template>
<script>
export default {
  name: "loginprotocol",
  data() {
    return {};
  },
  created() {
    // H5 plus事件处理
    function plusReady() {
      // 设置系统状态栏背景为蓝色
      plus.navigator.setStatusBarBackground("#2A76FF");
      plus.navigator.setStatusBarStyle("light");
    }
    if (window.plus) {
      plusReady();
    } else {
      document.addEventListener("plusready", plusReady, false);
    }
  },
  methods: {
    onBack() {
      history.back();
    }
  }
};
</script>
<style scpoed>
.loginprotocol {
  text-align: left;
  font-size: 0.75rem;
  line-height: 1.2rem;
}
.top_content {
  text-indent: 1.5rem;
  font-size: 0.6875rem;
}
.loginprotocol_title {
  color: #000;
  margin: 0.4rem 0rem;
}
.loginprotocol_content {
  font-size: 0.625rem;
  font-size: 0.6875rem;
}
</style>
